# print("100")
# print("%d"%100)
# print("100+100")
# print("%d" % (100+100))
# print("%d%d" %(100,200))
# print("%d" %(100))

# print("%d/%d=%f"%(100,200,0.5))

print("%d"%123) #숫자의 자릿수만큼 정렬
print("%5d"%123) #오른쪾에 붙여서 정렬
print("%05d"%123) #오른쪽에 붙여서 정렬, 빈칸을 0으로 채움

print("%f"%123.45) #소수점 아래 여섯 자리까지 무조건 출력
print("%7.1f"%123.45) #소수점 아래 첫째 자리만 출력, 소수점 아래 둘째 자리에서 반올림
print("%7.3f"%123.45) #소수점 아래 셋째 자리까지 출력, 오른쪽 빈칸은 0으로 채움

print("%s"%"python") #자릿수만큼 출력
print("%10s"%"python") #오른쪽 정렬


print("한 행 입니다. \n또 한 행입니다.")

print("%5s"%"*")
print("%6s"%"***")
print("%7s"%"*****")
print("%8s"%"*******")
print("%9s"%"*********")
print("%8s"%"*******")
print("%7s"%"*****")
print("%6s"%"***")
print("%5s"%"*")